ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ПартнерыСегмента/ПартнерыСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="94dc0182-a199-4a52-af04-ed95dec30b84">
  <name>ПартнерыСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="3e43a713-9c5c-4f6a-b17c-926c1ef0af85">
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="994998ea-b12e-4666-a2c7-8bd46b298b2f">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/CommonModules/ЖБИ_ОбщийМодульОтчетыИОбработки/Module.bsl
#Область Отборы

&НаСервере
Процедура УстановитьОтборДинСпискаПоСегменту(СписокСегмент, Список, ИмяОтбора, ВидСравнения) Экспорт
	
	Если СписокСегмент.Количество()=0 Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,ИмяОтбора);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСегмент", СписокСегмент);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ПартнерыСегмента.Партнер
					|ИЗ
					|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
					|ГДЕ
					|	ПартнерыСегмента.Сегмент В (&СписокСегмент)";
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	МассивПартнеров = РезультатЗапроса.ВыгрузитьКолонку("Партнер");
	Если МассивПартнеров.Количество()=0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, ИмяОтбора, МассивПартнеров, ВидСравнения, , );
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, ИмяОтбора, МассивПартнеров, ВидСравнения, , );	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент,Список,ЭтотОбъект,ИмяОтбора,ВидСравнения,ПроверятьЗаполнение = Ложь) Экспорт 
	
	Если ЗначениеЗаполнено(ЭтотОбъект[Элемент.Имя])
		ИЛИ ПроверятьЗаполнение Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, ИмяОтбора, ЭтотОбъект[Элемент.Имя], ВидСравнения, , );
	Иначе 
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,ИмяОтбора);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
